#include <M5Unified.h>

#include "efont.h"
#include "efontM5Unified.h"
#include "efontEnableJaMini.h"

const uint8_t smileEmoji[16][16] = {
  {0,0,0,0,0,0,1,1,1,1,0,0,0,0,0,0},
  {0,0,0,1,1,1,0,0,0,0,1,1,1,0,0,0},
  {0,0,1,0,0,0,0,0,0,0,0,0,1,0,0,0},
  {0,1,0,0,0,0,0,0,0,0,0,0,0,1,0,0},
  {1,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0},
  {1,0,0,0,1,0,0,0,0,0,0,1,0,0,1,0},
  {1,0,0,0,0,1,0,0,0,0,1,0,0,0,1,0},
  {1,0,0,0,0,0,1,1,1,1,0,0,0,0,1,0},
  {1,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0},
  {1,0,0,0,0,0,1,1,1,1,0,0,0,0,1,0},
  {0,1,0,0,0,1,0,0,0,0,1,0,0,0,1,0},
  {0,1,0,0,1,0,0,0,0,0,0,1,0,0,1,0},
  {0,0,1,1,0,0,0,0,0,0,0,0,1,1,0,0},
  {0,0,0,0,1,1,0,0,0,0,1,1,0,0,0,0},
  {0,0,0,0,0,0,1,1,1,1,0,0,0,0,0,0},
  {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
};


void drawSmileEmoji(int startX, int startY) {
  for (int y = 0; y < 16; y++) {
    for (int x = 0; x < 16; x++) {
      if (smileEmoji[y][x] == 1) {
        M5.Lcd.drawPixel(startX + x, startY + y, YELLOW); // 笑顔の部分を黄色で描画
      }
    }
  }
}

void setup() {
  M5.begin();
  
  printEfont("Hello", 1, 0, 16*0);
  printEfont("こんにちは", 2, 0, 16*1);
  printEfont("1月４日　土曜日　９時５５分", 3, 0, 16*2);

  M5.Lcd.fillRect(0, 0, 100, 16, TFT_BLACK);

  drawSmileEmoji(16*5, 16*5);
}

void loop() {
  M5.update();
}
